MikroElektronika/mikrosdk_v2/targets/pic_16bit/mikroe/dspic/include/spi_master/hal_ll_spi_master_pin_map.h
/****************************************************************************
**
** Copyright (C) ${COPYRIGHT_YEAR} MikroElektronika d.o.o.
** Contact: https://www.mikroe.com/contact
**
** This file is part of the mikroSDK package
**
** Commercial License Usage
**
** Licensees holding valid commercial NECTO compilers AI licenses may use this
** file in accordance with the commercial license agreement provided with the
** Software or, alternatively, in accordance with the terms contained in
** a written agreement between you and The MikroElektronika Company.
** For licensing terms and conditions see
** https://www.mikroe.com/legal/software-license-agreement.
** For further information use the contact form at
** https://www.mikroe.com/contact.
**
**
** GNU Lesser General Public License Usage
**
** Alternatively, this file may be used for
** non-commercial projects under the terms of the GNU Lesser
** General Public License version 3 as published by the Free Software
** Foundation: https://www.gnu.org/licenses/lgpl-3.0.html.
**
** The above copyright notice and this permission notice shall be
** included in all copies or substantial portions of the Software.
**
** THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
** EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
** OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
** IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
** DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT
** OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE
** OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
**
****************************************************************************/
/*!
 * @file  hal_ll_spi_master_pin_map.h
 * @brief SPI MASTER HAL LOW LEVEL PIN MAPS.
 */

#ifndef _HAL_LL_SPI_MASTER_PIN_MAP_H_
#define _HAL_LL_SPI_MASTER_PIN_MAP_H_

#ifdef __cplusplus
extern "C"{
#endif

#include "hal_ll_pin_names.h"

/*!< @brief Helper macro for getting adequate module index number */
#define hal_ll_spi_master_module_num(_module_num) (_module_num - 1)

/*!< @brief SPI Master pin map structure. */
typedef struct
{
    hal_ll_pin_name_t pin;
    uint8_t module_index;
} hal_ll_spi_master_pin_map_t;

/*!< @brief SPI MASTER SCK pins */
static const hal_ll_spi_master_pin_map_t _spi_sck_map[] = {
    //------------ BEGIN SCK
    #ifdef SPI1_SCK_RB6
    {GPIO_PB6, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RF6
    {GPIO_PF6, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RE8
    {GPIO_PE8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_SCK_RG6
    {GPIO_PG6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI1_SCK_RC3
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_SCK_RA0_RPI16
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RA1_RPI17
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RA2_RPI18
    {GPIO_PA2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RA3_RPI19
    {GPIO_PA3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RA4_RP20
    {GPIO_PA4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RA8_RPI24
    {GPIO_PA8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RA9_RPI25
    {GPIO_PA9, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB0_RPI32
    {GPIO_PB0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB1_RPI33
    {GPIO_PB1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB10_RP42
    {GPIO_PB10, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB11_RP43
    {GPIO_PB11, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB12_RPI44
    {GPIO_PB12, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB13_RPI45
    {GPIO_PB13, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB14_RPI46
    {GPIO_PB14, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB15_RPI47
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB2_RPI34
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB3_RP35
    {GPIO_PB3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB4_RP36
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB5_RP37
    {GPIO_PB5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB6_RP38
    {GPIO_PB6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB7_RP39
    {GPIO_PB7, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB8_RP40
    {GPIO_PB8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB9_RP41
    {GPIO_PB9, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC0_RP48
    {GPIO_PC0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC1_RP49
    {GPIO_PC1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC2_RPI50
    {GPIO_PC2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC3_RPI51
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC4_RPI52
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC5_RPI53
    {GPIO_PC5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC6_RP54
    {GPIO_PC6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC7_RP55
    {GPIO_PC7, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC8_RP56
    {GPIO_PC8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC9_RP57
    {GPIO_PC9, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_SCK_RA0_RPI16
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RA1_RPI17
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RA2_RPI18
    {GPIO_PA2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RA3_RPI19
    {GPIO_PA3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RA4_RP20
    {GPIO_PA4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RA8_RPI24
    {GPIO_PA8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RA9_RPI25
    {GPIO_PA9, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB0_RPI32
    {GPIO_PB0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB1_RPI33
    {GPIO_PB1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB10_RP42
    {GPIO_PB10, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB11_RP43
    {GPIO_PB11, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB12_RPI44
    {GPIO_PB12, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB13_RPI45
    {GPIO_PB13, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB14_RPI46
    {GPIO_PB14, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB15_RPI47
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB2_RPI34
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB3_RP35
    {GPIO_PB3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB4_RP36
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB5_RP37
    {GPIO_PB5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB6_RP38
    {GPIO_PB6, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB7_RP39
    {GPIO_PB7, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB8_RP40
    {GPIO_PB8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB9_RP41
    {GPIO_PB9, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC0_RP48
    {GPIO_PC0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC1_RP49
    {GPIO_PC1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC2_RPI50
    {GPIO_PC2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC3_RPI51
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC4_RPI52
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC5_RPI53
    {GPIO_PC5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC6_RP54
    {GPIO_PC6, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC7_RP55
    {GPIO_PC7, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC8_RP56
    {GPIO_PC8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC9_RP57
    {GPIO_PC9, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI2_SCK_RA11_RPI27
    {GPIO_PA11, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RA12_RPI28
    {GPIO_PA12, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC10_RPI58
    {GPIO_PC10, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC12_RPI60
    {GPIO_PC12, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC13_RPI61
    {GPIO_PC13, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC15_RPI63
    {GPIO_PC15, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RD5_RP69
    {GPIO_PD5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RD6_RP70
    {GPIO_PD6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RD8_RPI72
    {GPIO_PD8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RE14_RPI94
    {GPIO_PE14, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RE15_RPI95
    {GPIO_PE15, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RF0_RPI96
    {GPIO_PF0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RF1_RP97
    {GPIO_PF1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RG6_RP118
    {GPIO_PG6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RG7_RPI119
    {GPIO_PG7, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RG8_RP120
    {GPIO_PG8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RG9_RPI121
    {GPIO_PG9, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_SCK_RA11_RPI27
    {GPIO_PA11, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RA12_RPI28
    {GPIO_PA12, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC10_RPI58
    {GPIO_PC10, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC12_RPI60
    {GPIO_PC12, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC13_RPI61
    {GPIO_PC13, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC15_RPI63
    {GPIO_PC15, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RD5_RP69
    {GPIO_PD5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RD6_RP70
    {GPIO_PD6, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RD8_RPI72
    {GPIO_PD8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RE14_RPI94
    {GPIO_PE14, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RE15_RPI95
    {GPIO_PE15, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RF0_RPI96
    {GPIO_PF0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RF1_RP97
    {GPIO_PF1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RG6_RP118
    {GPIO_PG6, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RG7_RPI119
    {GPIO_PG7, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RG8_RP120
    {GPIO_PG8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RG9_RPI121
    {GPIO_PG9, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI2_SCK_RD12_RPI76
    {GPIO_PD12, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RD13_RPI77
    {GPIO_PD13, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RE0_RPI80
    {GPIO_PE0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RE1_RP81
    {GPIO_PE1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RG0_RPI112
    {GPIO_PG0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RG1_RP113
    {GPIO_PG1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RG12_RPI124
    {GPIO_PG12, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RG13_RP125
    {GPIO_PG13, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RG14_RP126
    {GPIO_PG14, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RG15_RP127
    {GPIO_PG15, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_SCK_RD12_RPI76
    {GPIO_PD12, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RD13_RPI77
    {GPIO_PD13, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RE0_RPI80
    {GPIO_PE0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RE1_RP81
    {GPIO_PE1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RG0_RPI112
    {GPIO_PG0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RG1_RP113
    {GPIO_PG1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RG12_RPI124
    {GPIO_PG12, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RG13_RP125
    {GPIO_PG13, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RG14_RP126
    {GPIO_PG14, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RG15_RP127
    {GPIO_PG15, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_SCK_RB7
    {GPIO_PB7, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RA0_RP16
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RA1_RP17
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RA2_RP18
    {GPIO_PA2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RA3_RP19
    {GPIO_PA3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RA4_RP20
    {GPIO_PA4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RB0_RP32
    {GPIO_PB0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RB1_RP33
    {GPIO_PB1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RB11_RP43
    {GPIO_PB11, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RB12_RP44
    {GPIO_PB12, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RB13_RP45
    {GPIO_PB13, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RB14_RP46
    {GPIO_PB14, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RB15_RP47
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RB2_RP34
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RB3_RP35
    {GPIO_PB3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RB4_RP36
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RB5_RP37
    {GPIO_PB5, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RB6_RP38
    {GPIO_PB6, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RB7_RP39
    {GPIO_PB7, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RB8_RP40
    {GPIO_PB8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RB9_RP41
    {GPIO_PB9, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_SCK_RA0_RP16
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RA1_RP17
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RA2_RP18
    {GPIO_PA2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RA3_RP19
    {GPIO_PA3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB0_RP32
    {GPIO_PB0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB1_RP33
    {GPIO_PB1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB12_RP44
    {GPIO_PB12, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB13_RP45
    {GPIO_PB13, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB14_RP46
    {GPIO_PB14, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB15_RP47
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RB2_RP34
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_SCK_RA0_RP16
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RA1_RP17
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RA2_RP18
    {GPIO_PA2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RA3_RP19
    {GPIO_PA3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB0_RP32
    {GPIO_PB0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB1_RP33
    {GPIO_PB1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB12_RP44
    {GPIO_PB12, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB13_RP45
    {GPIO_PB13, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB14_RP46
    {GPIO_PB14, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB15_RP47
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RB2_RP34
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_SCK_RC0_RP48
    {GPIO_PC0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RC1_RP49
    {GPIO_PC1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RC10_RP58
    {GPIO_PC10, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RC12_RP60
    {GPIO_PC12, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RC13_RP61
    {GPIO_PC13, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RC2_RP50
    {GPIO_PC2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RC3_RP51
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RC4_RP52
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RC5_RP53
    {GPIO_PC5, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RC6_RP54
    {GPIO_PC6, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RC7_RP55
    {GPIO_PC7, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RC8_RP56
    {GPIO_PC8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RC9_RP57
    {GPIO_PC9, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_SCK_RC10_RP58
    {GPIO_PC10, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC12_RP60
    {GPIO_PC12, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC13_RP61
    {GPIO_PC13, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC2_RP50
    {GPIO_PC2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC3_RP51
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC4_RP52
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RC5_RP53
    {GPIO_PC5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_SCK_RC10_RP58
    {GPIO_PC10, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC12_RP60
    {GPIO_PC12, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC13_RP61
    {GPIO_PC13, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC2_RP50
    {GPIO_PC2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC3_RP51
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC4_RP52
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RC5_RP53
    {GPIO_PC5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_SCK_RD10_RP74
    {GPIO_PD10, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RD4_RP68
    {GPIO_PD4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_SCK_RD10_RP74
    {GPIO_PD10, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_SCK_RD4_RP68
    {GPIO_PD4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_SCK_RD10_RP74
    {GPIO_PD10, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_SCK_RD4_RP68
    {GPIO_PD4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_SCK_RC14_RP62
    {GPIO_PC14, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RC15_RP63
    {GPIO_PC15, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RD0_RP64
    {GPIO_PD0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RD1_RP65
    {GPIO_PD1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RD11_RP75
    {GPIO_PD11, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RD12_RP76
    {GPIO_PD12, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RD2_RP66
    {GPIO_PD2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RD3_RP67
    {GPIO_PD3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RD5_RP69
    {GPIO_PD5, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RD6_RP70
    {GPIO_PD6, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RD7_RP71
    {GPIO_PD7, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RD8_RP72
    {GPIO_PD8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_SCK_RD9_RP73
    {GPIO_PD9, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
