MikroElektronika/mikrosdk_v2/targets/pic_16bit/mikroe/dspic/include/spi_master/hal_ll_spi_master_pin_map.h
    {GPIO_PA6, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RA7_RPI23
    {GPIO_PA7, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RC1_RPI49
    {GPIO_PC1, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RC2_RPI50
    {GPIO_PC2, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RC3_RPI51
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RC4_RPI52
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RD12_RPI76
    {GPIO_PD12, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RD13_RPI77
    {GPIO_PD13, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RD14_RPI78
    {GPIO_PD14, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RD15_RP79
    {GPIO_PD15, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RE8_RPI88
    {GPIO_PE8, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RE9_RPI89
    {GPIO_PE9, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RF12_RP108
    {GPIO_PF12, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RF13_RP109
    {GPIO_PF13, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RF2_RP98
    {GPIO_PF2, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RF8_RP104
    {GPIO_PF8, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RG0_RP112
    {GPIO_PG0, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RG1_RP113
    {GPIO_PG1, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RG12_RPI124
    {GPIO_PG12, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RG13_RP125
    {GPIO_PG13, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RG14_RP126
    {GPIO_PG14, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MISO_RG15_RP127
    {GPIO_PG15, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI1_MISO_RF6_RP102
    {GPIO_PF6, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MISO_RF6_RP102
    {GPIO_PF6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MISO_RF6_RP102
    {GPIO_PF6, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI4_MISO_RF6_RP102
    {GPIO_PF6, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI1_MISO_RB0_RP0
    {GPIO_PB0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB1_RP1
    {GPIO_PB1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB10_RP10
    {GPIO_PB10, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB11_RP11
    {GPIO_PB11, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB12_RP12
    {GPIO_PB12, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB13_RP13
    {GPIO_PB13, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB14_RP14
    {GPIO_PB14, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB15_RP15
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB2_RP2
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB3_RP3
    {GPIO_PB3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB4_RP4
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB5_RP5
    {GPIO_PB5, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB6_RP6
    {GPIO_PB6, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB7_RP7
    {GPIO_PB7, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB8_RP8
    {GPIO_PB8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB9_RP9
    {GPIO_PB9, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MISO_RB0_RP0
    {GPIO_PB0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RB1_RP1
    {GPIO_PB1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RB10_RP10
    {GPIO_PB10, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RB11_RP11
    {GPIO_PB11, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RB12_RP12
    {GPIO_PB12, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RB13_RP13
    {GPIO_PB13, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RB14_RP14
    {GPIO_PB14, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RB15_RP15
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RB2_RP2
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RB3_RP3
    {GPIO_PB3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RB4_RP4
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RB5_RP5
    {GPIO_PB5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RB6_RP6
    {GPIO_PB6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RB7_RP7
    {GPIO_PB7, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RB8_RP8
    {GPIO_PB8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RB9_RP9
    {GPIO_PB9, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI1_MISO_RC0_RP16
    {GPIO_PC0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RC1_RP17
    {GPIO_PC1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RC2_RP18
    {GPIO_PC2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RC3_RP19
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RC4_RP20
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RC5_RP21
    {GPIO_PC5, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RC6_RP22
    {GPIO_PC6, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RC7_RP23
    {GPIO_PC7, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RC8_RP24
    {GPIO_PC8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RC9_RP25
    {GPIO_PC9, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MISO_RC0_RP16
    {GPIO_PC0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RC1_RP17
    {GPIO_PC1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RC2_RP18
    {GPIO_PC2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RC3_RP19
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RC4_RP20
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RC5_RP21
    {GPIO_PC5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RC6_RP22
    {GPIO_PC6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RC7_RP23
    {GPIO_PC7, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RC8_RP24
    {GPIO_PC8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RC9_RP25
    {GPIO_PC9, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI1_MISO_RC10_RP26
    {GPIO_PC10, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RC11_RP27
    {GPIO_PC11, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RC12_RP28
    {GPIO_PC12, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RC13_RP29
    {GPIO_PC13, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB10
    {GPIO_PB10, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB14
    {GPIO_PB14, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MISO_RB0
    {GPIO_PB0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RA7
    {GPIO_PA7, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RC3
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI1_MISO_RB15_RP29
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB2_RP13
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB4_RP28
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RB5_RP18
    {GPIO_PB5, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RC14_RPI37
    {GPIO_PC14, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RD0_RP11
    {GPIO_PD0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RD1_RP24
    {GPIO_PD1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RD10_RP3
    {GPIO_PD10, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RD11_RP12
    {GPIO_PD11, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RD2_RP23
    {GPIO_PD2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RD3_RP22
    {GPIO_PD3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RD4_RP25
    {GPIO_PD4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RD5_RP20
    {GPIO_PD5, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RD8_RP2
    {GPIO_PD8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RD9_RP4
    {GPIO_PD9, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RF2_RP30
    {GPIO_PF2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RF3_RP16
    {GPIO_PF3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RF4_RP10
    {GPIO_PF4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RF5_RP17
    {GPIO_PF5, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RG6_RP21
    {GPIO_PG6, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RG7_RP26
    {GPIO_PG7, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RG8_RP19
    {GPIO_PG8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RG9_RP27
    {GPIO_PG9, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MISO_RB15_RP29
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RB2_RP13
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RB4_RP28
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RB5_RP18
    {GPIO_PB5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RC14_RPI37
    {GPIO_PC14, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RD0_RP11
    {GPIO_PD0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RD1_RP24
    {GPIO_PD1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RD10_RP3
    {GPIO_PD10, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RD11_RP12
    {GPIO_PD11, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RD2_RP23
    {GPIO_PD2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RD3_RP22
    {GPIO_PD3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RD4_RP25
    {GPIO_PD4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RD5_RP20
    {GPIO_PD5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RD8_RP2
    {GPIO_PD8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RD9_RP4
    {GPIO_PD9, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RF2_RP30
    {GPIO_PF2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RF3_RP16
    {GPIO_PF3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RF4_RP10
    {GPIO_PF4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RF5_RP17
    {GPIO_PF5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RG6_RP21
    {GPIO_PG6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RG7_RP26
    {GPIO_PG7, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RG8_RP19
    {GPIO_PG8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RG9_RP27
    {GPIO_PG9, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MISO_RB0_RP0
    {GPIO_PB0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB1_RP1
    {GPIO_PB1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB14_RP14
    {GPIO_PB14, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB15_RP29
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB2_RP13
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB4_RP28
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB5_RP18
    {GPIO_PB5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB6_RP6
    {GPIO_PB6, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB7_RP7
    {GPIO_PB7, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB8_RP8
    {GPIO_PB8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB9_RP9
    {GPIO_PB9, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RC14_RPI37
    {GPIO_PC14, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RD0_RP11
    {GPIO_PD0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RD1_RP24
    {GPIO_PD1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RD10_RP3
    {GPIO_PD10, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RD11_RP12
    {GPIO_PD11, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RD2_RP23
    {GPIO_PD2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RD3_RP22
    {GPIO_PD3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RD4_RP25
    {GPIO_PD4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RD5_RP20
    {GPIO_PD5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RD8_RP2
    {GPIO_PD8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RD9_RP4
    {GPIO_PD9, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RF2_RP30
    {GPIO_PF2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RF3_RP16
    {GPIO_PF3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RF4_RP10
    {GPIO_PF4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RF5_RP17
    {GPIO_PF5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RG6_RP21
    {GPIO_PG6, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RG7_RP26
    {GPIO_PG7, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RG8_RP19
    {GPIO_PG8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RG9_RP27
    {GPIO_PG9, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_MISO_RA14_RPI36
    {GPIO_PA14, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RA15_RPI35
    {GPIO_PA15, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RC1_RPI38
    {GPIO_PC1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RC2_RPI39
    {GPIO_PC2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RC3_RPI40
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RC4_RPI41
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RD12_RPI42
    {GPIO_PD12, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RD14_RPI43
    {GPIO_PD14, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RD15_RP5
    {GPIO_PD15, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RE8_RPI33
    {GPIO_PE8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RE9_RPI34
    {GPIO_PE9, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RF12_RPI32
    {GPIO_PF12, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RF13_RP31
    {GPIO_PF13, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RF8_RP15
    {GPIO_PF8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MISO_RA14_RPI36
    {GPIO_PA14, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RA15_RPI35
    {GPIO_PA15, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RC1_RPI38
    {GPIO_PC1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RC2_RPI39
    {GPIO_PC2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RC3_RPI40
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RC4_RPI41
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RD12_RPI42
    {GPIO_PD12, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RD14_RPI43
    {GPIO_PD14, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RD15_RP5
    {GPIO_PD15, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RE8_RPI33
    {GPIO_PE8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RE9_RPI34
    {GPIO_PE9, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RF12_RPI32
    {GPIO_PF12, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RF13_RP31
    {GPIO_PF13, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RF8_RP15
    {GPIO_PF8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MISO_RA14_RPI36
    {GPIO_PA14, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RA15_RPI35
    {GPIO_PA15, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RC1_RPI38
    {GPIO_PC1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RC2_RPI39
    {GPIO_PC2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RC3_RPI40
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RC4_RPI41
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RD12_RPI42
    {GPIO_PD12, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RD14_RPI43
    {GPIO_PD14, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RD15_RP5
    {GPIO_PD15, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RE8_RPI33
    {GPIO_PE8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RE9_RPI34
    {GPIO_PE9, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RF12_RPI32
    {GPIO_PF12, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RF13_RP31
    {GPIO_PF13, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RF8_RP15
    {GPIO_PF8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_MISO_RF6_RPI45
    {GPIO_PF6, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MISO_RF6_RPI45
    {GPIO_PF6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MISO_RF6_RPI45
    {GPIO_PF6, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_MISO_RF7_RPI44
    {GPIO_PF7, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MISO_RF7_RPI44
    {GPIO_PF7, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MISO_RF7_RPI44
    {GPIO_PF7, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_MISO_RB4_RPI4
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MISO_RB4_RPI4
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MISO_RB10_RP10
    {GPIO_PB10, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB11_RP11
    {GPIO_PB11, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB12_RP12
    {GPIO_PB12, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB13_RP13
    {GPIO_PB13, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB15_RP15
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB2_RP2
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB3_RP3
    {GPIO_PB3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB4_RPI4
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB5_RP5
    {GPIO_PB5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RC0_RP16
    {GPIO_PC0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RC1_RP17
    {GPIO_PC1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RC2_RP18
    {GPIO_PC2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RC3_RP19
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RC4_RP20
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RC5_RP21
    {GPIO_PC5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RC6_RP22
    {GPIO_PC6, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RC7_RP23
    {GPIO_PC7, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RC8_RP24
    {GPIO_PC8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RC9_RP25
    {GPIO_PC9, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI4_MISO_RB13
    {GPIO_PB13, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI1_MISO_RA0_RP26
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RA1_RP27
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MISO_RA0_RP26
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RA1_RP27
