MikroElektronika/mikrosdk_v2/targets/pic_16bit/mikroe/dspic/include/spi_master/hal_ll_spi_master_pin_map.h
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MISO_RA0_RP26
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RA1_RP27
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RB4_RP4
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_MISO_RA10_RP28
    {GPIO_PA10, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MISO_RA10_RP28
    {GPIO_PA10, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MISO_RA10_RP28
    {GPIO_PA10, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_MISO_RA11_RPIN29
    {GPIO_PA11, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RA12_RPIN30
    {GPIO_PA12, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RA13_RPIN31
    {GPIO_PA13, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RA14_RPIN32
    {GPIO_PA14, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MISO_RA11_RPIN29
    {GPIO_PA11, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RA12_RPIN30
    {GPIO_PA12, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RA13_RPIN31
    {GPIO_PA13, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RA14_RPIN32
    {GPIO_PA14, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MISO_RA11_RPIN29
    {GPIO_PA11, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RA12_RPIN30
    {GPIO_PA12, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RA13_RPIN31
    {GPIO_PA13, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RA14_RPIN32
    {GPIO_PA14, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_MISO_RA0_RP5
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MISO_RA1_RP6
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MISO_RA0_RP5
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MISO_RA1_RP6
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MISO_RA0_RP5
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MISO_RA1_RP6
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    { HAL_LL_PIN_NC, HAL_LL_MODULE_ERROR }
    //------------ END MISO
};

/*!< @brief SPI MASTER MOSI pins */
static const hal_ll_spi_master_pin_map_t _spi_mosi_map[] = {
    //------------ BEGIN MOSI
    #ifdef SPI1_MOSI_RB4
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RF3
    {GPIO_PF3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MOSI_RG8
    {GPIO_PG8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI1_MOSI_RF8
    {GPIO_PF8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RA4
    {GPIO_PA4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MOSI_RA4_RP20
    {GPIO_PA4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB10_RP42
    {GPIO_PB10, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB11_RP43
    {GPIO_PB11, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB3_RP35
    {GPIO_PB3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB4_RP36
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB5_RP37
    {GPIO_PB5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB6_RP38
    {GPIO_PB6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB7_RP39
    {GPIO_PB7, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB8_RP40
    {GPIO_PB8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB9_RP41
    {GPIO_PB9, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC0_RP48
    {GPIO_PC0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC1_RP49
    {GPIO_PC1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC6_RP54
    {GPIO_PC6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC7_RP55
    {GPIO_PC7, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC8_RP56
    {GPIO_PC8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC9_RP57
    {GPIO_PC9, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MOSI_RA4_RP20
    {GPIO_PA4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB10_RP42
    {GPIO_PB10, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB11_RP43
    {GPIO_PB11, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB3_RP35
    {GPIO_PB3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB4_RP36
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB5_RP37
    {GPIO_PB5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB6_RP38
    {GPIO_PB6, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB7_RP39
    {GPIO_PB7, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB8_RP40
    {GPIO_PB8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB9_RP41
    {GPIO_PB9, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC0_RP48
    {GPIO_PC0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC1_RP49
    {GPIO_PC1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC6_RP54
    {GPIO_PC6, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC7_RP55
    {GPIO_PC7, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC8_RP56
    {GPIO_PC8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC9_RP57
    {GPIO_PC9, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI2_MOSI_RD5_RP69
    {GPIO_PD5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD6_RP70
    {GPIO_PD6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RF1_RP97
    {GPIO_PF1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RG6_RP118
    {GPIO_PG6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RG8_RP120
    {GPIO_PG8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MOSI_RD5_RP69
    {GPIO_PD5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD6_RP70
    {GPIO_PD6, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RF1_RP97
    {GPIO_PF1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RG6_RP118
    {GPIO_PG6, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RG8_RP120
    {GPIO_PG8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI2_MOSI_RE1_RP81
    {GPIO_PE1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RG1_RP113
    {GPIO_PG1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RG13_RP125
    {GPIO_PG13, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RG14_RP126
    {GPIO_PG14, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RG15_RP127
    {GPIO_PG15, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MOSI_RE1_RP81
    {GPIO_PE1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RG1_RP113
    {GPIO_PG1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RG13_RP125
    {GPIO_PG13, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RG14_RP126
    {GPIO_PG14, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RG15_RP127
    {GPIO_PG15, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_MOSI_RB8
    {GPIO_PB8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RA0_RP16
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RA1_RP17
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RA2_RP18
    {GPIO_PA2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RA3_RP19
    {GPIO_PA3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RA4_RP20
    {GPIO_PA4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB0_RP32
    {GPIO_PB0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB1_RP33
    {GPIO_PB1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB11_RP43
    {GPIO_PB11, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB12_RP44
    {GPIO_PB12, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB13_RP45
    {GPIO_PB13, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB14_RP46
    {GPIO_PB14, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB15_RP47
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB2_RP34
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB3_RP35
    {GPIO_PB3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB4_RP36
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB5_RP37
    {GPIO_PB5, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB6_RP38
    {GPIO_PB6, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB7_RP39
    {GPIO_PB7, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB8_RP40
    {GPIO_PB8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB9_RP41
    {GPIO_PB9, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MOSI_RA0_RP16
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RA1_RP17
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RA2_RP18
    {GPIO_PA2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RA3_RP19
    {GPIO_PA3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB0_RP32
    {GPIO_PB0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB1_RP33
    {GPIO_PB1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB12_RP44
    {GPIO_PB12, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB13_RP45
    {GPIO_PB13, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB14_RP46
    {GPIO_PB14, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB15_RP47
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB2_RP34
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MOSI_RA0_RP16
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RA1_RP17
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RA2_RP18
    {GPIO_PA2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RA3_RP19
    {GPIO_PA3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB0_RP32
    {GPIO_PB0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB1_RP33
    {GPIO_PB1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB12_RP44
    {GPIO_PB12, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB13_RP45
    {GPIO_PB13, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB14_RP46
    {GPIO_PB14, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB15_RP47
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB2_RP34
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_MOSI_RC0_RP48
    {GPIO_PC0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC1_RP49
    {GPIO_PC1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC10_RP58
    {GPIO_PC10, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC12_RP60
    {GPIO_PC12, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC13_RP61
    {GPIO_PC13, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC2_RP50
    {GPIO_PC2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC3_RP51
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC4_RP52
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC5_RP53
    {GPIO_PC5, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC6_RP54
    {GPIO_PC6, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC7_RP55
    {GPIO_PC7, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC8_RP56
    {GPIO_PC8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC9_RP57
    {GPIO_PC9, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MOSI_RC10_RP58
    {GPIO_PC10, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC12_RP60
    {GPIO_PC12, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC13_RP61
    {GPIO_PC13, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC2_RP50
    {GPIO_PC2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC3_RP51
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC4_RP52
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC5_RP53
    {GPIO_PC5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MOSI_RC10_RP58
    {GPIO_PC10, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC12_RP60
    {GPIO_PC12, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC13_RP61
    {GPIO_PC13, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC2_RP50
    {GPIO_PC2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC3_RP51
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC4_RP52
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC5_RP53
    {GPIO_PC5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_MOSI_RD10_RP74
    {GPIO_PD10, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD4_RP68
    {GPIO_PD4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MOSI_RD10_RP74
    {GPIO_PD10, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD4_RP68
    {GPIO_PD4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MOSI_RD10_RP74
    {GPIO_PD10, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD4_RP68
    {GPIO_PD4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_MOSI_RC14_RP62
    {GPIO_PC14, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC15_RP63
    {GPIO_PC15, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD0_RP64
    {GPIO_PD0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD1_RP65
    {GPIO_PD1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD11_RP75
    {GPIO_PD11, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD12_RP76
    {GPIO_PD12, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD2_RP66
    {GPIO_PD2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD3_RP67
    {GPIO_PD3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD5_RP69
    {GPIO_PD5, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD6_RP70
    {GPIO_PD6, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD7_RP71
    {GPIO_PD7, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD8_RP72
    {GPIO_PD8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD9_RP73
    {GPIO_PD9, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MOSI_RC14_RP62
    {GPIO_PC14, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC15_RP63
    {GPIO_PC15, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD0_RP64
    {GPIO_PD0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD1_RP65
    {GPIO_PD1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD11_RP75
    {GPIO_PD11, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD12_RP76
    {GPIO_PD12, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD2_RP66
    {GPIO_PD2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD3_RP67
    {GPIO_PD3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD7_RP71
    {GPIO_PD7, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD8_RP72
    {GPIO_PD8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD9_RP73
    {GPIO_PD9, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MOSI_RC14_RP62
    {GPIO_PC14, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC15_RP63
    {GPIO_PC15, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD0_RP64
    {GPIO_PD0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD1_RP65
    {GPIO_PD1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD11_RP75
    {GPIO_PD11, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD12_RP76
    {GPIO_PD12, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD2_RP66
    {GPIO_PD2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD3_RP67
    {GPIO_PD3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD7_RP71
    {GPIO_PD7, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD8_RP72
    {GPIO_PD8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD9_RP73
    {GPIO_PD9, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_MOSI_RB10_RP42
    {GPIO_PB10, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC11_RP59
    {GPIO_PC11, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MOSI_RC11_RP59
    {GPIO_PC11, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI1_MOSI_RE0_RP80
    {GPIO_PE0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RE2_RP82
    {GPIO_PE2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RE4_RP84
    {GPIO_PE4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RE5_RP85
    {GPIO_PE5, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RE7_RP87
    {GPIO_PE7, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RF0_RP96
    {GPIO_PF0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RF1_RP97
    {GPIO_PF1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RF3_RP99
    {GPIO_PF3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RF4_RP100
    {GPIO_PF4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RF5_RP101
    {GPIO_PF5, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RG6_RP118
    {GPIO_PG6, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RG8_RP120
    {GPIO_PG8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MOSI_RE0_RP80
    {GPIO_PE0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RE2_RP82
    {GPIO_PE2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RE4_RP84
    {GPIO_PE4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RE5_RP85
    {GPIO_PE5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RE7_RP87
    {GPIO_PE7, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RF0_RP96
    {GPIO_PF0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RF3_RP99
    {GPIO_PF3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RF4_RP100
    {GPIO_PF4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RF5_RP101
    {GPIO_PF5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MOSI_RE0_RP80
    {GPIO_PE0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RE2_RP82
    {GPIO_PE2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RE4_RP84
    {GPIO_PE4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RE5_RP85
    {GPIO_PE5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RE7_RP87
    {GPIO_PE7, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RF0_RP96
    {GPIO_PF0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RF3_RP99
    {GPIO_PF3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RF4_RP100
    {GPIO_PF4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RF5_RP101
    {GPIO_PF5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI4_MOSI_RD0_RP64
    {GPIO_PD0, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RD1_RP65
    {GPIO_PD1, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RD2_RP66
    {GPIO_PD2, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RD3_RP67
    {GPIO_PD3, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RD4_RP68
    {GPIO_PD4, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RD5_RP69
    {GPIO_PD5, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RD6_RP70
    {GPIO_PD6, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RD7_RP71
    {GPIO_PD7, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RE0_RP80
