MikroElektronika/mikrosdk_v2/targets/pic_16bit/mikroe/dspic/include/spi_master/hal_ll_spi_master_pin_map.h
    {GPIO_PE0, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RE2_RP82
    {GPIO_PE2, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RE4_RP84
    {GPIO_PE4, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RE5_RP85
    {GPIO_PE5, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RE7_RP87
    {GPIO_PE7, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RF0_RP96
    {GPIO_PF0, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RF1_RP97
    {GPIO_PF1, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RF3_RP99
    {GPIO_PF3, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RF4_RP100
    {GPIO_PF4, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RF5_RP101
    {GPIO_PF5, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RG6_RP118
    {GPIO_PG6, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RG8_RP120
    {GPIO_PG8, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI1_MOSI_RD15_RP79
    {GPIO_PD15, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RF12_RP108
    {GPIO_PF12, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RF13_RP109
    {GPIO_PF13, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RF2_RP98
    {GPIO_PF2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RF8_RP104
    {GPIO_PF8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RG0_RP112
    {GPIO_PG0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RG1_RP113
    {GPIO_PG1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RG13_RP125
    {GPIO_PG13, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RG14_RP126
    {GPIO_PG14, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RG15_RP127
    {GPIO_PG15, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MOSI_RD15_RP79
    {GPIO_PD15, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RF12_RP108
    {GPIO_PF12, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RF13_RP109
    {GPIO_PF13, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RF2_RP98
    {GPIO_PF2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RF8_RP104
    {GPIO_PF8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RG0_RP112
    {GPIO_PG0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MOSI_RD15_RP79
    {GPIO_PD15, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RF12_RP108
    {GPIO_PF12, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RF13_RP109
    {GPIO_PF13, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RF2_RP98
    {GPIO_PF2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RF8_RP104
    {GPIO_PF8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RG0_RP112
    {GPIO_PG0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI4_MOSI_RD15_RP79
    {GPIO_PD15, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RF12_RP108
    {GPIO_PF12, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RF13_RP109
    {GPIO_PF13, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RF2_RP98
    {GPIO_PF2, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RF8_RP104
    {GPIO_PF8, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RG0_RP112
    {GPIO_PG0, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RG1_RP113
    {GPIO_PG1, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RG13_RP125
    {GPIO_PG13, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RG14_RP126
    {GPIO_PG14, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI4_MOSI_RG15_RP127
    {GPIO_PG15, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI1_MOSI_RF6_RP102
    {GPIO_PF6, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MOSI_RF6_RP102
    {GPIO_PF6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MOSI_RF6_RP102
    {GPIO_PF6, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI4_MOSI_RF6_RP102
    {GPIO_PF6, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI1_MOSI_RB0_RP0
    {GPIO_PB0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB1_RP1
    {GPIO_PB1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB10_RP10
    {GPIO_PB10, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB11_RP11
    {GPIO_PB11, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB12_RP12
    {GPIO_PB12, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB13_RP13
    {GPIO_PB13, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB14_RP14
    {GPIO_PB14, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB15_RP15
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB2_RP2
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB3_RP3
    {GPIO_PB3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB4_RP4
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB5_RP5
    {GPIO_PB5, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB6_RP6
    {GPIO_PB6, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB7_RP7
    {GPIO_PB7, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB8_RP8
    {GPIO_PB8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB9_RP9
    {GPIO_PB9, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MOSI_RB0_RP0
    {GPIO_PB0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB1_RP1
    {GPIO_PB1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB10_RP10
    {GPIO_PB10, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB11_RP11
    {GPIO_PB11, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB12_RP12
    {GPIO_PB12, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB13_RP13
    {GPIO_PB13, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB14_RP14
    {GPIO_PB14, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB15_RP15
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB2_RP2
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB3_RP3
    {GPIO_PB3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB4_RP4
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB5_RP5
    {GPIO_PB5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB6_RP6
    {GPIO_PB6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB7_RP7
    {GPIO_PB7, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB8_RP8
    {GPIO_PB8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB9_RP9
    {GPIO_PB9, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI1_MOSI_RC0_RP16
    {GPIO_PC0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC1_RP17
    {GPIO_PC1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC2_RP18
    {GPIO_PC2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC3_RP19
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC4_RP20
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC5_RP21
    {GPIO_PC5, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC6_RP22
    {GPIO_PC6, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC7_RP23
    {GPIO_PC7, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC8_RP24
    {GPIO_PC8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC9_RP25
    {GPIO_PC9, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MOSI_RC0_RP16
    {GPIO_PC0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC1_RP17
    {GPIO_PC1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC2_RP18
    {GPIO_PC2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC3_RP19
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC4_RP20
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC5_RP21
    {GPIO_PC5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC6_RP22
    {GPIO_PC6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC7_RP23
    {GPIO_PC7, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC8_RP24
    {GPIO_PC8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC9_RP25
    {GPIO_PC9, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI1_MOSI_RC10_RP26
    {GPIO_PC10, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC11_RP27
    {GPIO_PC11, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC12_RP28
    {GPIO_PC12, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RC13_RP29
    {GPIO_PC13, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB13
    {GPIO_PB13, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MOSI_RA1
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB6
    {GPIO_PB6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RC4
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI1_MOSI_RB15_RP29
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB2_RP13
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB4_RP28
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RB5_RP18
    {GPIO_PB5, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD0_RP11
    {GPIO_PD0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD1_RP24
    {GPIO_PD1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD10_RP3
    {GPIO_PD10, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD11_RP12
    {GPIO_PD11, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD2_RP23
    {GPIO_PD2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD3_RP22
    {GPIO_PD3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD4_RP25
    {GPIO_PD4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD5_RP20
    {GPIO_PD5, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD8_RP2
    {GPIO_PD8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RD9_RP4
    {GPIO_PD9, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RF2_RP30
    {GPIO_PF2, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RF3_RP16
    {GPIO_PF3, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RF4_RP10
    {GPIO_PF4, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RF5_RP17
    {GPIO_PF5, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RG6_RP21
    {GPIO_PG6, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RG7_RP26
    {GPIO_PG7, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RG8_RP19
    {GPIO_PG8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RG9_RP27
    {GPIO_PG9, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MOSI_RB15_RP29
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB2_RP13
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB4_RP28
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RB5_RP18
    {GPIO_PB5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD0_RP11
    {GPIO_PD0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD1_RP24
    {GPIO_PD1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD10_RP3
    {GPIO_PD10, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD11_RP12
    {GPIO_PD11, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD2_RP23
    {GPIO_PD2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD3_RP22
    {GPIO_PD3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD4_RP25
    {GPIO_PD4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD5_RP20
    {GPIO_PD5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD8_RP2
    {GPIO_PD8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RD9_RP4
    {GPIO_PD9, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RF2_RP30
    {GPIO_PF2, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RF3_RP16
    {GPIO_PF3, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RF4_RP10
    {GPIO_PF4, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RF5_RP17
    {GPIO_PF5, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RG6_RP21
    {GPIO_PG6, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RG7_RP26
    {GPIO_PG7, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RG8_RP19
    {GPIO_PG8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RG9_RP27
    {GPIO_PG9, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MOSI_RB0_RP0
    {GPIO_PB0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB1_RP1
    {GPIO_PB1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB14_RP14
    {GPIO_PB14, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB15_RP29
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB2_RP13
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB4_RP28
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB5_RP18
    {GPIO_PB5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB6_RP6
    {GPIO_PB6, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB7_RP7
    {GPIO_PB7, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB8_RP8
    {GPIO_PB8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB9_RP9
    {GPIO_PB9, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD0_RP11
    {GPIO_PD0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD1_RP24
    {GPIO_PD1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD10_RP3
    {GPIO_PD10, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD11_RP12
    {GPIO_PD11, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD2_RP23
    {GPIO_PD2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD3_RP22
    {GPIO_PD3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD4_RP25
    {GPIO_PD4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD5_RP20
    {GPIO_PD5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD8_RP2
    {GPIO_PD8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RD9_RP4
    {GPIO_PD9, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RF2_RP30
    {GPIO_PF2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RF3_RP16
    {GPIO_PF3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RF4_RP10
    {GPIO_PF4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RF5_RP17
    {GPIO_PF5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RG6_RP21
    {GPIO_PG6, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RG7_RP26
    {GPIO_PG7, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RG8_RP19
    {GPIO_PG8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RG9_RP27
    {GPIO_PG9, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_MOSI_RD15_RP5
    {GPIO_PD15, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RF13_RP31
    {GPIO_PF13, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RF8_RP15
    {GPIO_PF8, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MOSI_RD15_RP5
    {GPIO_PD15, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RF13_RP31
    {GPIO_PF13, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RF8_RP15
    {GPIO_PF8, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MOSI_RD15_RP5
    {GPIO_PD15, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RF13_RP31
    {GPIO_PF13, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RF8_RP15
    {GPIO_PF8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB10_RP10
    {GPIO_PB10, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB11_RP11
    {GPIO_PB11, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB12_RP12
    {GPIO_PB12, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB13_RP13
    {GPIO_PB13, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB15_RP15
    {GPIO_PB15, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB2_RP2
    {GPIO_PB2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB3_RP3
    {GPIO_PB3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB5_RP5
    {GPIO_PB5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC0_RP16
    {GPIO_PC0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC1_RP17
    {GPIO_PC1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC2_RP18
    {GPIO_PC2, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC3_RP19
    {GPIO_PC3, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC4_RP20
    {GPIO_PC4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC5_RP21
    {GPIO_PC5, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC6_RP22
    {GPIO_PC6, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC7_RP23
    {GPIO_PC7, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC8_RP24
    {GPIO_PC8, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RC9_RP25
    {GPIO_PC9, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI4_MOSI_RB10
    {GPIO_PB10, hal_ll_spi_master_module_num(SPI_MODULE_4)},
    #endif
    #ifdef SPI1_MOSI_RA0_RP26
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RA1_RP27
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MOSI_RA0_RP26
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RA1_RP27
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MOSI_RA0_RP26
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RA1_RP27
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RB4_RP4
    {GPIO_PB4, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_MOSI_RA10_RP28
    {GPIO_PA10, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MOSI_RA10_RP28
    {GPIO_PA10, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MOSI_RA10_RP28
    {GPIO_PA10, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI1_MOSI_RA0_RP5
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI1_MOSI_RA1_RP6
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_1)},
    #endif
    #ifdef SPI2_MOSI_RA0_RP5
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI2_MOSI_RA1_RP6
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_2)},
    #endif
    #ifdef SPI3_MOSI_RA0_RP5
    {GPIO_PA0, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    #ifdef SPI3_MOSI_RA1_RP6
    {GPIO_PA1, hal_ll_spi_master_module_num(SPI_MODULE_3)},
    #endif
    { HAL_LL_PIN_NC, HAL_LL_MODULE_ERROR }
    //------------ END MOSI
};

#ifdef __cplusplus
}
#endif

#endif // _HAL_LL_SPI_MASTER_PIN_MAP_H_
// ------------------------------------------------------------------------- END
